In [1]:
import pandas as pd

In [2]:
import numpy as np

In [4]:
state_data={
    'State':['Alabama','Alaska','Arizon','Arkansas'],
    'PostCode':['AL','AK','AZ','AR'],
    'Area':['52,423','656,424','*','53182'],
    'Pop':['4,040,587','550,043','3,665,228','2,350,750']
}

In [5]:
stdf = pd.DataFrame(state_data, columns=['State','PostCode','Area','Pop'])

In [6]:
stdf

      State PostCode     Area        Pop
0   Alabama       AL   52,423  4,040,587
1    Alaska       AK  656,424    550,043
2    Arizon       AZ        *  3,665,228
3  Arkansas       AR    53182  2,350,750

In [7]:
stdf['Area']

0     52,423
1    656,424
2          *
3      53182
Name: Area, dtype: object

In [9]:
stdf = stdf.set_index('State')

In [10]:
stdf

         PostCode     Area        Pop
State
Alabama        AL   52,423  4,040,587
Alaska         AK  656,424    550,043
Arizon         AZ        *  3,665,228
Arkansas       AR    53182  2,350,750

In [11]:
stdf = stdf.replace('*', '0')

In [12]:
stdf

         PostCode     Area        Pop
State
Alabama        AL   52,423  4,040,587
Alaska         AK  656,424    550,043
Arizon         AZ        0  3,665,228
Arkansas       AR    53182  2,350,750

In [13]:
def item_replace(xstr):
    return xstr.replace(',','')

In [15]:
stdf['Area'] = stdf['Area'].map(item_replace)

In [16]:
stdf

         PostCode    Area        Pop
State
Alabama        AL   52423  4,040,587
Alaska         AK  656424    550,043
Arizon         AZ       0  3,665,228
Arkansas       AR   53182  2,350,750

In [18]:
stdf['Pop'] = stdf['Pop'].map(item_replace)

In [19]:
stdf

         PostCode    Area      Pop
State
Alabama        AL   52423  4040587
Alaska         AK  656424   550043
Arizon         AZ       0  3665228
Arkansas       AR   53182  2350750